{
	"name": "360 Global Blocks",
	"slug": "360-global-blocks",
	"version": "1.3.57",
	"download_url": "https://github.com/KazimirAlvis/360-global-blocks/archive/refs/heads/main.zip",
	"requires": "6.0",
	"tested": "6.9",
	"requires_php": "7.4",
	"last_updated": "2025-12-31 17:20:00",
	"author": "<a href='https://github.com/KazimirAlvis'>Kaz Alvis</a>",
	"author_profile": "https://github.com/KazimirAlvis",
	"homepage": "https://github.com/KazimirAlvis/360-global-blocks",
	"sections": {
		"description": "<p>Custom Gutenberg blocks tailored for the 360 network. Includes hero layouts, CTA components, clinic listings, info cards, and PatientReach360 assessment integrations designed for healthcare organizations.</p>",
		"installation": "<ol><li>Download the latest release ZIP from GitHub.</li><li>Upload via Plugins → Add New → Upload Plugin.</li><li>Activate and locate the blocks inside the \"360 Blocks\" category.</li></ol>",
		"changelog": "<h4>1.3.57</h4><ul><li>Added an editor-facing alt text field to the Two Column block, auto-prefilled from media metadata and rendered on the frontend so block imagery no longer ships empty <code>alt</code> attributes.</li><li>Updated the Video Two Column lite YouTube thumbnail to reuse the video title (or block heading) for its <code>alt</code> copy, keeping autoplay placeholders accessible.</li></ul><h4>1.3.56</h4><ul><li>Surface the first Global Blocks image directly inside Gutenberg so Yoast SEO sees that media during analysis, eliminating the recurring \"No images appear on this page\" warning for block-driven layouts.</li><li>Localize the collector output and dispatch <code>setContentImage()</code> in the <code>yoast-seo/editor</code> store only when Yoast and supported post types are present, keeping the bridge lightweight.</li></ul><h4>1.3.55</h4><ul><li>Added the Patient Reviews Slider block with header, background color selection, and responsive slider controls.</li><li>Added the One Column Video block with heading, YouTube link field, background color selection, and a centered 1140px layout.</li></ul><h4>1.3.54</h4><ul><li>Removed extra padding on <code>.main-paragraph-con</code> inside the Video Two Column body.</li></ul><h4>1.3.53</h4><ul><li>Added a None option to the Info Cards icon selector so cards can render without an icon.</li></ul><h4>1.3.52</h4><ul><li>Let the Comparison Table background color cover the full-width section while the heading, table, and footnote stay centered inside a 1140px inner wrapper for consistent alignment.</li><li>Synced the table header and body cell borders so every column shows subtle dividers and the highlighted header row keeps sentence-case typography instead of forcing row labels.</li><li>Removed the outer box shadow from the FAQ Accordion wrapper so it blends into tinted landing page bands while each accordion card retains its own elevation.</li></ul><h4>1.3.51</h4><ul><li>Introduced a Comparison Table block with selectable column and row counts so service-line pages can reuse the treatment matrix layout without manually coding tables.</li><li>Auto-paints the highlighted header row with the brand color stored in 360 settings (falling back to <code>--cpt360-primary</code>) while shipping responsive zebra-striping styles for both the editor and frontend.</li></ul><h4>1.3.50</h4><ul><li>Always enqueues the shared <code>global-shared.min.css</code> bundle so blog templates without questionnaire blocks still load the Page Title Hero width constraints.</li><li>Strengthened the shared `.sm_hero h1` rule with <code>!important</code> values to preserve the centered 1140px width and 1.4 line-height when themes inject their own heading styles.</li></ul><h4>1.3.49</h4><ul><li>Forced every Page Title Hero heading to inherit the centered 1140px max width even when themes apply their own `.sm_hero h1` rules.</li><li>Rebuilt the block so the editor preview and compiled frontend CSS keep the 1.4 line-height and `margin: 0 auto` consistently.</li></ul><h4>1.3.48</h4><ul><li>Centered the Page Title Hero heading inside a 1140px max width with margin auto so long service-line names stay aligned with the rest of the hero grid.</li><li>Reduced the hero H1 line-height to 1.4 and rebuilt the block assets so the refreshed typography matches in both the editor preview and the frontend.</li></ul><h4>1.3.47</h4><ul><li>Swapped the Video Two Column body field to InnerBlocks so bullets, numbered lists, and quotes can be added without leaving the block.</li><li>Migrates existing body text automatically and refreshes the frontend styles so paragraphs and lists share consistent spacing.</li></ul><h4>1.3.46</h4><ul><li>Added a palette-aware background color picker to the Video Two Column block so the full-width section can match branded surfaces without custom CSS.</li><li>Adjusted the editor UI, frontend CSS, and PHP render wrapper so the selected color blankets the entire block instead of only the content column.</li></ul><h4>1.3.45</h4><ul><li>Added the standard Media position toggle to the Video Two Column block so the video column can flip to either side without recreating the section.</li><li>Synced the editor preview, frontend CSS, and PHP render markup with the toggle so padding and grid order always follow the selected layout.</li></ul><h4>1.3.44</h4><ul><li>Kept the FAQ Accordion background full bleed while constraining the dropdown list to a centered 1140px width with 20px gutters.</li><li>Rebuilt the FAQ bundle so GitHub auto-updates ship the refreshed layout immediately.</li></ul><h4>1.3.43</h4><ul><li>Kept the FAQ Accordion answer editors visible and labeled in WordPress 6.9, removing deprecated RichText props that prevented the fields from being editable.</li><li>Loosened the question and answer spacing so multi-line copy reads comfortably on both the front end and inside the editor.</li></ul><h4>1.3.42</h4><ul><li>Introduced a FAQ Accordion block with reorderable RichText questions, answer fields, and palette-aware background plus open-state color controls.</li><li>Bundled a lightweight frontend script so only one dropdown stays open at a time while mirroring the smooth animation seen in the editor.</li></ul><h4>1.3.41</h4><ul><li>Added palette-integrated color controls to the Two Column block for both headings and backgrounds.</li><li>Ensured the frontend render mirrors those selections for a consistent preview.</li></ul><h4>1.3.40</h4><ul><li>Matched the Two Column CTA button styles and default copy to the PatientReach360 questionnaire button.</li><li>Removed the extra left padding on CTA headings and body text wrappers for clean alignment inside the grid.</li></ul><h4>1.3.39</h4><ul><li>Added the Two Column CTA block with an 800/300 split grid, InnerBlocks-powered content column, configurable button, and adjustable background color.</li></ul><h4>1.3.38</h4><ul><li>Standardized repository and folder naming to lowercase (<code>360-global-blocks</code>) to ensure consistent plugin paths across development and production environments.</li><li>Updated manifest URL and download links to point to the renamed GitHub repository.</li></ul><h4>1.3.37</h4><ul><li>Fixed a missing closing <code>&lt;/div&gt;</code> tag in the Two Column Slider render function that was causing all subsequent page content to be incorrectly wrapped inside the slider container.</li></ul><h4>1.3.36</h4><ul><li>Forced the Two Column block to stack media above content on phones, even when the layout toggle pins imagery to the right column on desktop.</li><li>Kept the editor and frontend markup identical so the CSS-only layout flip preserves DOM order for better accessibility and predictable theming.</li></ul><h4>1.3.35</h4><ul><li>Added a media-position toggle to the Two Column block so you can flip the image to the right column without duplicating layouts.</li><li>Synchronized editor and frontend padding, including a dedicated <code>40px 80px 40px 30px</code> spacing pass when the image is right-aligned.</li></ul><h4>1.3.34</h4><ul><li>Removed the remaining grid gap in the Two Column block so the media column can sit flush with the viewport edge on desktop.</li><li>Locked the desktop padding to <code>40px 30px 40px 80px</code> and rebuilt the bundle so the text column now matches the Video Two Column block.</li></ul><h4>1.3.33</h4><ul><li>Eliminated leftover padding on legacy <code>main-*-con</code> wrappers so two-column body copy now lines up with its heading in both the editor and the front end.</li><li>Regenerated the two-column block assets to ship the refined spacing defaults with this release.</li></ul><h4>1.3.32</h4><ul><li>Bundled the Health Icons catalog directly into the Info Cards editor build so the full picker loads without enqueueing extra scripts.</li><li>Swapped the CTA heading for a RichText field so editors can update the hero message inline while keeping the frontend output sanitized.</li><li>Rebuilt affected block assets and bumped release metadata for the GitHub auto-updater.</li></ul><h4>1.3.31</h4><ul><li>Split every block into dedicated <code>edit.js</code> and lightweight <code>view.js</code> bundles so editor-only dependencies stay out of the frontend.</li><li>Refreshed the manifest-driven loader so WordPress only enqueues the new view builds when matching blocks render.</li><li>Retired the experimental health icon loader and tidied shared assets to keep the plugin lean.</li></ul><h4>1.3.30</h4><ul><li>Converted the Full Hero background from CSS to an eager <code>&lt;img&gt;</code> tag so browsers can surface the hero art as the page's Largest Contentful Paint, complete with width, height, and alt metadata.</li><li>Tuned the Full Hero typography across desktop, tablet, and mobile breakpoints so headings remain bold without overwhelming smaller screens.</li><li>Rebuilt the Full Hero bundle and refreshed block manifests to ensure WordPress registers the updated assets after deployment.</li></ul><h4>1.3.29</h4><ul><li>Added a shared <code>global-shared.min.css</code> bundle that automatically loads whenever a PatientReach360 questionnaire button renders, keeping assessments styled even on pages without the CTA block.</li><li>Recompiled block assets after moving the questionnaire button rules out of individual bundles, trimming duplicate CSS from the CTA, Full Hero, Two Column, and Video Two Column blocks.</li><li>Removed the unused legacy <code>global360blocks/hero</code> scaffold to eliminate inaccurate unsupported-block notices inside Gutenberg.</li></ul><h4>1.3.28</h4><ul><li>Converted the Video Two Column block to a lite YouTube embed so the full player loads only after interaction, trimming unused network requests on initial page load.</li><li>Added a <code>global360blocks_video_two_column_use_lite_embed</code> filter so site owners can opt back into the classic iframe renderer without modifying plugin files.</li></ul><h4>1.3.27</h4><ul><li>Introduced a manifest-driven asset loader so block CSS and scripts only load when their block renders, dramatically reducing unused frontend styles.</li><li>Added safeguards that always queue Latest Articles styling on blog/archive templates and preload hero bundles when detected above the fold to eliminate flashes of unstyled content.</li><li>Exposed filters for extending forced asset lists so custom templates can opt in without editing plugin code.</li></ul><h4>1.3.26</h4><ul><li>Forced the Video Two Column block to stack its controls vertically with inline flex fallbacks so cached admin CSS can no longer collapse the video URL input over the title.</li><li>Recompiled the block bundle and rescanned manifests to ship the layout guardrails with this release.</li></ul><h4>1.3.25</h4><ul><li>Polished trademark styling in the Full Hero block so ™/®/℠ render as compact superscripts on both the front end and inside the editor.</li><li>Refreshed block source styles to match Prettier formatting so diffs stay clean across future updates.</li></ul><h4>1.3.24</h4><ul><li>Added an optional video title field to the Video Two Column block so editors can reinforce messaging directly above each embed.</li><li>Render the new title as an <code>&lt;h2&gt;</code> and apply the shared heading font stack at 2.5rem/400 so typography stays consistent across the site.</li><li>Rebuilt the block assets to ship the updated markup and styling with this release.</li></ul><h4>1.3.23</h4><ul><li>Introduced a global <code>--heading-letter-spacing</code> variable that resolves to 0.5px only when the site loads the Anton heading font.</li><li>Updated every block stylesheet to consume the new variable and recompiled the build assets so frontend and editor stay in sync.</li><li>Ensured the inline CSS helper sets the same letter-spacing rules inside the editor wrapper for consistent previews.</li></ul><h4>1.3.22</h4><ul><li>Standardized typography across every block so headings and buttons now pull the theme's <code>--heading-font</code>, <code>--body-font</code>, and weight variables with a 400 fallback.</li><li>Recompiled all block bundles to ship the updated CSS alongside the source changes.</li><li>Confirmed manifests and render templates are recopied during builds so WordPress keeps registering each block after updates.</li></ul><h4>1.3.21</h4><ul><li>Streamlined the Two Column Slider on phones with tighter padding, reduced shadows, and responsive typography so the card height fits comfortably on small screens.</li><li>Automatically hides the companion slide image below tablet widths, keeping the focus on messaging while trimming excess vertical real estate.</li><li>Mirrored the mobile styling updates in the editor experience so authors preview the same stacked layout while editing.</li></ul><h4>1.3.20</h4><ul><li>Reworked the Popular Practices block so it never repeats random clinics and centers layouts gracefully when fewer than four cards are available.</li><li>Expanded clinic logo pads to 150px with matching image constraints for cleaner brand display across all column widths.</li><li>Ensured slider and popular practices block metadata stays bundled in build artifacts, preventing \"unsupported block\" warnings after future deployments.</li></ul><h4>1.3.19</h4><ul><li>Gave each Two Column Slider card its own background color picker so marketing teams can apply per-slide accents without custom CSS.</li><li>Capped hero-side imagery at 700px (desktop) to prevent tall uploads from stretching the layout while keeping the mobile stack flexible.</li><li>Updated the build pipeline to include the slider block metadata, preventing \"unsupported block\" warnings after future deployments.</li></ul>..."
	}
}
