{
	"name": "360 Global Blocks",
	"slug": "360-global-blocks",
	"version": "1.3.38",
	"download_url": "https://github.com/KazimirAlvis/360-global-blocks/archive/refs/heads/main.zip",
	"requires": "6.0",
	"tested": "6.7",
	"requires_php": "7.4",
	"last_updated": "2025-12-02 12:23:56",
	"author": "<a href='https://github.com/KazimirAlvis'>Kaz Alvis</a>",
	"author_profile": "https://github.com/KazimirAlvis",
	"homepage": "https://github.com/KazimirAlvis/360-global-blocks",
	"sections": {
		"description": "<p>Custom Gutenberg blocks tailored for the 360 network. Includes hero layouts, CTA components, clinic listings, info cards, and PatientReach360 assessment integrations designed for healthcare organizations.</p>",
		"installation": "<ol><li>Download the latest release ZIP from GitHub.</li><li>Upload via Plugins → Add New → Upload Plugin.</li><li>Activate and locate the blocks inside the \"360 Blocks\" category.</li></ol>",
		"changelog": "<h4>1.3.38</h4><ul><li>Standardized repository and folder naming to lowercase (<code>360-global-blocks</code>) to ensure consistent plugin paths across development and production environments.</li><li>Updated manifest URL and download links to point to the renamed GitHub repository.</li></ul><h4>1.3.37</h4><ul><li>Fixed a missing closing <code>&lt;/div&gt;</code> tag in the Two Column Slider render function that was causing all subsequent page content to be incorrectly wrapped inside the slider container.</li></ul><h4>1.3.36</h4><ul><li>Forced the Two Column block to stack media above content on phones, even when the layout toggle pins imagery to the right column on desktop.</li><li>Kept the editor and frontend markup identical so the CSS-only layout flip preserves DOM order for better accessibility and predictable theming.</li></ul><h4>1.3.35</h4><ul><li>Added a media-position toggle to the Two Column block so you can flip the image to the right column without duplicating layouts.</li><li>Synchronized editor and frontend padding, including a dedicated <code>40px 80px 40px 30px</code> spacing pass when the image is right-aligned.</li></ul><h4>1.3.34</h4><ul><li>Removed the remaining grid gap in the Two Column block so the media column can sit flush with the viewport edge on desktop.</li><li>Locked the desktop padding to <code>40px 30px 40px 80px</code> and rebuilt the bundle so the text column now matches the Video Two Column block.</li></ul><h4>1.3.33</h4><ul><li>Eliminated leftover padding on legacy <code>main-*-con</code> wrappers so two-column body copy now lines up with its heading in both the editor and the front end.</li><li>Regenerated the two-column block assets to ship the refined spacing defaults with this release.</li></ul><h4>1.3.32</h4><ul><li>Bundled the Health Icons catalog directly into the Info Cards editor build so the full picker loads without enqueueing extra scripts.</li><li>Swapped the CTA heading for a RichText field so editors can update the hero message inline while keeping the frontend markup sanitized.</li><li>Rebuilt affected block assets and bumped release metadata for the GitHub auto-updater.</li></ul><h4>1.3.31</h4><ul><li>Split every block into dedicated <code>edit.js</code> and lightweight <code>view.js</code> bundles so editor-only dependencies stay out of the frontend.</li><li>Refreshed the manifest-driven loader so WordPress only enqueues the new view builds when matching blocks render.</li><li>Retired the experimental health icon loader and tidied shared assets to keep the plugin lean.</li></ul><h4>1.3.30</h4><ul><li>Converted the Full Hero background from CSS to an eager <code>&lt;img&gt;</code> tag so browsers can surface the hero art as the page's Largest Contentful Paint, complete with width, height, and alt metadata.</li><li>Tuned the Full Hero typography across desktop, tablet, and mobile breakpoints so headings remain bold without overwhelming smaller screens.</li><li>Rebuilt the Full Hero bundle and refreshed block manifests to ensure WordPress registers the updated assets after deployment.</li></ul><h4>1.3.29</h4><ul><li>Added a shared <code>global-shared.min.css</code> bundle that automatically loads whenever a PatientReach360 questionnaire button renders, keeping assessments styled even on pages without the CTA block.</li><li>Recompiled block assets after moving the questionnaire button rules out of individual bundles, trimming duplicate CSS from the CTA, Full Hero, Two Column, and Video Two Column blocks.</li><li>Removed the unused legacy <code>global360blocks/hero</code> scaffold to eliminate inaccurate unsupported-block notices inside Gutenberg.</li></ul><h4>1.3.28</h4><ul><li>Converted the Video Two Column block to a lite YouTube embed so the full player loads only after interaction, trimming unused network requests on initial page load.</li><li>Added a <code>global360blocks_video_two_column_use_lite_embed</code> filter so site owners can opt back into the classic iframe renderer without modifying plugin files.</li></ul><h4>1.3.27</h4><ul><li>Introduced a manifest-driven asset loader so block CSS and scripts only load when their block renders, dramatically reducing unused frontend styles.</li><li>Added safeguards that always queue Latest Articles styling on blog/archive templates and preload hero bundles when detected above the fold to eliminate flashes of unstyled content.</li><li>Exposed filters for extending forced asset lists so custom templates can opt in without editing plugin code.</li></ul><h4>1.3.26</h4><ul><li>Forced the Video Two Column block to stack its controls vertically with inline flex fallbacks so cached admin CSS can no longer collapse the video URL input over the title.</li><li>Recompiled the block bundle and rescanned manifests to ship the layout guardrails with this release.</li></ul><h4>1.3.25</h4><ul><li>Polished trademark styling in the Full Hero block so ™/®/℠ render as compact superscripts on both the front end and inside the editor.</li><li>Refreshed block source styles to match Prettier formatting so diffs stay clean across future updates.</li></ul><h4>1.3.24</h4><ul><li>Added an optional video title field to the Video Two Column block so editors can reinforce messaging directly above each embed.</li><li>Render the new title as an <code>&lt;h2&gt;</code> and apply the shared heading font stack at 2.5rem/400 so typography stays consistent across the site.</li><li>Rebuilt the block assets to ship the updated markup and styling with this release.</li></ul><h4>1.3.23</h4><ul><li>Introduced a global <code>--heading-letter-spacing</code> variable that resolves to 0.5px only when the site loads the Anton heading font.</li><li>Updated every block stylesheet to consume the new variable and recompiled the build assets so frontend and editor stay in sync.</li><li>Ensured the inline CSS helper sets the same letter-spacing rules inside the editor wrapper for consistent previews.</li></ul><h4>1.3.22</h4><ul><li>Standardized typography across every block so headings and buttons now pull the theme's <code>--heading-font</code>, <code>--body-font</code>, and weight variables with a 400 fallback.</li><li>Recompiled all block bundles to ship the updated CSS alongside the source changes.</li><li>Confirmed manifests and render templates are recopied during builds so WordPress keeps registering each block after updates.</li></ul><h4>1.3.21</h4><ul><li>Streamlined the Two Column Slider on phones with tighter padding, reduced shadows, and responsive typography so the card height fits comfortably on small screens.</li><li>Automatically hides the companion slide image below tablet widths, keeping the focus on messaging while trimming excess vertical real estate.</li><li>Mirrored the mobile styling updates in the editor experience so authors preview the same stacked layout while editing.</li></ul><h4>1.3.20</h4><ul><li>Reworked the Popular Practices block so it never repeats random clinics and centers layouts gracefully when fewer than four cards are available.</li><li>Expanded clinic logo pads to 150px with matching image constraints for cleaner brand display across all column widths.</li><li>Ensured slider and popular practices block metadata stays bundled in build artifacts, preventing \"unsupported block\" warnings after future deployments.</li></ul><h4>1.3.19</h4><ul><li>Gave each Two Column Slider card its own background color picker so marketing teams can apply per-slide accents without custom CSS.</li><li>Capped hero-side imagery at 700px (desktop) to prevent tall uploads from stretching the layout while keeping the mobile stack flexible.</li><li>Updated the build pipeline to include the slider block metadata, preventing \"unsupported block\" warnings after future deployments.</li></ul><h4>1.3.18</h4><ul><li>Aligned the Two Column Text block preview so columns stay side-by-side inside Gutenberg while stacking only on narrower breakpoints.</li><li>Removed grid styling from WordPress wrapper classes to avoid admin conflicts without disturbing the front-end layout.</li><li>Included the required block-editor data dependencies in the build to resolve the \"This block has encountered an error\" notice after the latest enhancements.</li></ul><h4>1.3.17</h4><ul><li>Added a Two Column Text block offering twin InnerBlock-powered columns plus per-column background color controls for rich copy layouts.</li><li>Hooked the new block into the build pipeline and PHP registration so it ships with GitHub updates without extra setup.</li><li>Relaxed editor locking so the columns stay in place yet paragraph-to-list and other core transforms remain available after unlocking.</li></ul><h4>1.3.16</h4><ul><li>Persist InnerBlocks markup for the two-column block so migrated body content renders on the front end without manual fixes (re-save affected pages once after updating).</li><li>Ensure GitHub-powered updates preserve the mixed-case <code>360-Global-Blocks</code> folder name to avoid directory renames during installs.</li></ul><h4>1.3.15</h4><ul><li>Hardened the GitHub updater so extracted branch archives are always renamed to <code>360-global-blocks</code>, preventing post-update block registration issues.</li><li>Added a cleanup helper that removes stray <code>-main</code> folders before moving files into place, avoiding duplicate plugin directories.</li></ul><h4>1.3.14</h4><ul><li>Overhauled the two-column block to use native InnerBlocks content, migrating legacy body fields and sanitizing editor placeholders automatically.</li><li>Hardened the PHP render callback so nested paragraphs and lists render on the front end while stripping duplicate images, headings, and button text.</li><li>Refined block padding and typography for a tighter match between the editor preview and live layout.</li></ul><h4>1.3.13</h4><ul><li>Rebuilt the two-column slider with a horizontal track, crisp arrow artwork, improved spacing, and autoplay safeguards to eliminate flicker.</li></ul><h4>1.3.12</h4><ul><li>Unified questionnaire button copy across CTA, video two-column, two-column, and Find Doctor blocks with updated hover styling.</li><li>Flattened heading spacing for info cards and popular practices blocks to align with the latest layout polish.</li></ul><h4>1.3.11</h4><ul><li>Polished the full hero, info cards, and video two-column blocks with wider containers, consistent padding, and fully responsive video embeds.</li></ul><h4>1.3.10</h4><ul><li>Routine validation bump to confirm the branch-archive updater path continues to install cleanly.</li></ul><h4>1.3.9</h4><ul><li>Ensured GitHub branch archives are renamed back to <code>360-global-blocks</code> during updates so the plugin folder never gains a <code>-main</code> suffix.</li></ul><h4>1.3.8</h4><ul><li>Validated the branch-archive updater with an additional smoke-test bump.</li><li>Documented the GitHub-based updater for future reference.</li></ul><h4>1.3.7</h4><ul><li>Synced the latest FTP tweaks and prepped the GitHub release payload.</li></ul><h4>1.3.6</h4><ul><li>Synchronized FTP changes into version control and prepared GitHub release assets.</li></ul><h4>1.3.5</h4><ul><li>Switch to a lightweight, manifest-driven updater compatible with GitHub-hosted ZIP packages.</li><li>Added manifest diagnostics in Tools → 360 Blocks Updates.</li></ul><h4>1.3.4</h4><ul><li>Switched to the Plugin Update Checker library for reliable GitHub updates.</li><li>Synced the Git repository with the live FTP copy and updated diagnostics tooling.</li></ul>"
	}
}
